---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AutomaticLandingConvertedToSketchedLandingWarning
source: html/03668b2a-d28a-5b0b-6b3d-39edec955309.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AutomaticLandingConvertedToSketchedLandingWarning Property

Some run(s) are deleted, so automatic landing is converted to sketched landing.

## Syntax (C#)
```csharp
public static FailureDefinitionId AutomaticLandingConvertedToSketchedLandingWarning { get; }
```